# Rebar Bend Data Termination Rotation Angle 0 Property

Source: https://www.revitapidocs.com/2026/56c23a20-95b8-0536-476e-febbd5398508.htm

---

| Rebar Bend Data Termination Rotation Angle 0 Property |
| --- |

Identifies the termination's rotation angle (in radians) at the start.
 The default value is 0\.0
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public double TerminationRotationAngle0 { get; set; }
```

```
Public Property TerminationRotationAngle0 As Double
	Get
	Set
```

```
public:
property double TerminationRotationAngle0 {
	double get ();
	void set (double value);
}
```

```
member TerminationRotationAngle0 : float with get, set
```

#### Property Value

Double Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The given value for terminationRotationAngle0 is not finite |

See Also

#### Reference

RebarBendData Class Autodesk.Revit.DB.Structure Namespace